function clock() {

    for (let hours = 0; hours <= 23; hours++) { // часовете се променят когато минутите надвищат 59. Ако искам да добавя 0 преди часа ако той е примеро 1 то тогава пиша код if (hour < 10) hour = "0"+hour;

        for (let minutes = 0; minutes <= 59; minutes++) { // докато минутите се променят часовете остават същите. Ако искам да добавя 0 преди минутите примерно ако са 2 минути да станат 02 то тогава пиша код if (minutes < 10) minutes = "0"+minutes
            console.log(`${hours}:${minutes}`);
        }

    }
}

clock();