function timePlus15Min(input) {
    let hour = Number(input[0]);
    let minutes = Number(input[1]);

    let totalTimeInMinutes = hour * 60 + (minutes + 15); // 1 * 60 + 46 = 106 + доп. минути 15 = 121 минути
    let newHour = Math.floor(totalTimeInMinutes / 60); // 121 минути / 60(зашото има 60 мин в 1 час) = 2.01 (два часа и една минута)
    let newMinutes = totalTimeInMinutes % 60; // тук с ПРОЦЕНТНОТО ДЕЛЕНИЕ взимам остатъка от горния ред .01 (едната минута)

    if (newHour === 24) { // Това е добавено, защото в 12 през нощта не искаме да изписва 24:56 (например), а 0:56. Затова пишем, че ако часовете са равни на 24, искаме да ги преобразуваме в 0.

        newHour = 0
    }
    
    if (newMinutes < 10) {                               // Тук ако минутите са под 10 да се изписва с 0 ПРИМЕР 2:02 , 2:03 , ако са над 10 else изпълнява ПРИМЕР 2:11 , 2:25.
        console.log(`${newHour}:0${newMinutes}`);
    } else {
        console.log(`${newHour}:${newMinutes}`);
    }
}

timePlus15Min(["1", "46"]);

// Тук 1:46 = 1 час = 60 мин > h * 60 +и добавям минутите(46) min = Чаът в минути 
// полученото го деля на 60 за да видя колко часa сa ми минутите(тоест ако имам 121 мин / 60 = 2.01666667 тоест 2 часа и 01мин.) + Math.floor or .trunc , за да го закръгля на 2
// и след това за да си намеря оставащите минути предната променлива тоест горния текст ПРОЦЕНТНО ДЕЛЯ на 60 ( % 60).
// тоест целия процес е : от часове и минути h:min > само в min > и после го изписваме пак в h:min 