function numbersDivisibleBy9(input) {

    let num1 = Number(input[0]);
    let num2 = Number(input[1]);

    let sum = 0; // Тук създадох променлива sum(обща стойност) която после трябваше да логна след като е изчислена в If`a
    let outputNumbers = ``; // Тук създадох променлива да ми се вкарат числата който после трябваше да логна тоест числата който се делят на 9 с остатък 0.

    for (let i = num1; i <= num2; i = i + 1) { // i ми е 0ия вход тоест 100 , докато 100 е по малко или равно на 1вия ми вход , i да се увеличава с 1 тоест +1.

        if (i % 9 === 0) {
            sum = sum + i; // Тук всяко число което се дели на 9 с остатък 0 се събира с друго такова число и се запазва в променливата Sum.
            outputNumbers = outputNumbers + i + "\n"; // "\n" - буквално означава нов ред , ползвам за да изписвам на отделни редове. Когато първото число което се дели на 9 с остатък 0 излезе , то влиза в outputNumbers и в Sum на горния ред се събира с следващото което влезе по условие true както е написано по код.
        }

    }
    console.log(`The sum: ${sum}`); // Логвам извън скоупа общата стойност след като са се събрали числата
    console.log(outputNumbers); // Тук запазените числа който се делят на 9 с остатък 0.
}

numbersDivisibleBy9(["100", "200"]);