function graduation(input) {
    let index = 0; // задавам индекс 0
    let name = input[index]; // името ще приеме индекс 0 зашото е на индекс 0 по вход.
    index++; // увеличавам индекса!!!
    let year = 1; // годината започва от 1 тъй като почва от 1ви клас до 12ти.
    let sumGrade = 0;
    let examFailed = 0;
    let excluded = false; // това е варянт за решение на задачата. Задавам булева променлива

    while (year <= 12) { // докато годината ми е по малка или равна на 12 цикъла се повтаря. Почвам от година 1 която съм задал като променлива по горе в кода.
        let currentGrade = Number(input[index]); // тук взимам текущата оценка с инпут от индекс която е на първи индекс тоест (5).
        index++; // и след взимането увеличавам индекса да за да получа следващата входна данна. тоест взел съм оценката от индекс 1 и вече съм на индекс 2

        if (currentGrade < 4) { // Ако текущата оценка е по малка от 4
            examFailed++; // променливата която създадох в началото на кода ще се увеличи с едно.
            if (examFailed == 2) { // ако същата променлива въде равна на 2 то тогава
                excluded = true; // булевата променлива да приеме стойност true тоест от false както е зададена в началото ще стане true тъй като учека е скъсан два пъти и приключва програмта.
                break; // тук е break за да се приключи програмта.
            }
            continue; // тук ме връща отвново в проверка
        }
        sumGrade = sumGrade + currentGrade; // тук сумирам оценките тъй като накрая трабва да намеря средната оценка тоест
        year++; // и накрая увеличавам годината.
    }

    if (excluded === false) {
        let averageGrade = sumGrade / 12;
        console.log(`${name} graduated. Average grade: ${averageGrade.toFixed(2)}`);
    } else {
        console.log(`${name} has been excluded at ${year} grade`);
    }
}

graduation(["Mimi", 
"5",
"6",
"5",
"6",
"5",
"6",
"6",
"2",
"3"]);