function maxNumber(input) {

    let number = input[0]; // взимам статичен 0 индекс там числото ми е 100
    let index = 1; // вдигам индекса на 1вия там имам 99
    let maxNum = Number.MIN_SAFE_INTEGER; // най-малкото възможно число в системата.

    while (number !== "Stop") { // докато числото ми е различно от стринга "Stop" да се изпълнява като е еднакво със стринга да спре!
        let num = Number(number); // тук числото ми все още е 100 ..

        if (num > maxNum) { // ако числото ми е по голямо от възможното най-малко
            maxNum = num; // тогава вече споменатата променлива приема стойноста на горе споменатото число..
        }

        number = input[index]; // взимам следващото число което вече е от индекс 1 то е 99..
        index++; // и инкрементирам индекса който вече става 2 , а в while се проверява предното тоест 99...
    }
    
    console.log(maxNum);
}

maxNumber(["100",
"99",
"80",
"70",
"Stop"]);