function sumNumbers(input) {

    let num = Number(input[0]); // взимам входна данна от 0 индекс тоест 100
    let sum = 0; // тъй като трябва да сумирам си създавам променлива която е от 0 тъй като все още не съм извършил действието.
    let index = 1; // и индекса ми да започва от 1 , тъй като вече 0 е използван.

    while (sum < num) { //
        let currentNumber = Number(input[index]); // чета си първото число от индекс който е вече 1 тоест числото е 10.
        sum = sum + currentNumber; // нека то да се събере в променливата sum.
        index++; // взимам следващия индекс тоест 2 там имам числото 20 и т.н
    }

    console.log(sum); // докато сумата ми не стигна 100, излизам от цикъла и принтирам sum.
}

sumNumbers(["100",
"10",
"20",
"30",
"40"]);