function vacation(input) {

    let index = 0; // Задаван си индекс от 0;

    let vacationCost = Number(input[index]); // тук взимам стойноста от индекс 0 тоест колко струва ваканцията
    index++; // веднага инкрементирам за да мога после да взема директно следващия.

    let currentMoneyAvailable = Number(input[index]); // вече тук съм взел следващия индекс който е 1 и това са наличните пари.
    index++; // веднага пак инкрементирам индеска и вече той е 2 за да мога после да си го взема директно.

    let action = input[index]; // тук вече си взимам действието от индекс 2 дали действието е spend or save.
    index++; // и веднага инкрементирам индекса за да мога после пак да го взема директно.

    let sum = Number(input[index]); // тук вече взимам данните от индекс 3 тоест сумата която или ще spend или ще save.
    index++; // и отново инкрементирам индеска за да мога после да го взема директно.

    let daysSpentCount = 0; // тук създавам променлива която по условие на задачата трябва да ми запаазва колко дена действието е било spend
    let daysPassed = 0; //а тук колко дена са изминали като стойноста и на двете ми е 0 тъй като все още не съм направил проверката.

    while (currentMoneyAvailable < vacationCost) { // докато наличните пари са по-малко от цената на ваканцията цикъла да се повтаря.
        daysPassed++; // увеличавам миналите дни тъй като вече един е минал.

        if (action === "spend") { // ако действието е равно на "spend"
            if (sum > currentMoneyAvailable) { // и ако сумата е по голяма от наличните пари
                currentMoneyAvailable = 0; // то тогава текушите ми пари ще станат 0 тъй като съм ги похарчил.
            } else { // но ако те не са повече
            currentMoneyAvailable -= sum; // то тогава искам само да извадя от наличните пари - похарчените.
            }

            daysSpentCount++; // и тук искам да добавя един ден тъй като вече съм приключил с него.
        } else { // ако действието ми е друго то тогава ще е save.
            currentMoneyAvailable += sum; // искам към досегашните налични пари да добавя парите който съм спестил.
            daysSpentCount = 0; // и дните който съм харчил да са 0; тоест тук ако съм имал 2 поредни дни в който съм харчил при действие save те ще е занулят на 0 , защото по условие 
        }

        if (daysSpentCount === 5) { // ако дните който съм харчил са равни на 5 поредни
            console.log("You can't save the money."); // то тогава логвам
            console.log(`${daysPassed}`); //
            return; // и приключвам програмата.
        }

        action = input[index]; // за да направя следваща евентуална проверка си взимам отново действието от индекса който вече преди това съм взел
        index++; // веднага инкрементирам индекса за да мога да го взема после директно

        sum = Number(input[index]); // и естествено тук за евентуална следваща проверка пак си взимам сумата от действието с индекс който преди това съм инкрементирал.
        index++; // и веднага го инкрементирам отново ако се наложи да го ползвам.
    }

    console.log(`You saved the money for ${daysPassed} days.`); // и тук извън цикъла логвам.

    


}

vacation(["110",
"60",
"spend",
"10",
"spend",
"10",
"spend",
"10",
"spend",
"10",
"spend",
"10"]);