function walking(input) {

    let stepsGoal = 10000; // тук задавам стъпките който са цел
    let stepsSum = 0; // тук си създавам променлива която да сумира общите стъпки който съм направил която все още е нула защото по доло провеярам и ще се ъпдейтва в процеса.

    let index = 0; // зададох индекс от 0.
    let stepsWalked = input[index]; // тук взимам стойноста от индекс 0.
    index++; // и веднага инкрементирам за да мога после да си взема следващата стойност на следващия под ред индекс тоест вече ще бъде 1


    while (stepsWalked !== "Going home") { // докато изминатите стъпки са различни от командата цикъла ще върти.
        stepsWalked = Number(stepsWalked); // тук преобръщам в число.
        stepsSum += stepsWalked; // и добавям стъпките към горе споменатата променлива за общото сумиране.

        if (stepsSum >= stepsGoal) { // ако стъпките който съм направил са повече или равни на целта стъпки
            console.log("Goal reached! Good job!"); // то тогава логвам
            console.log(`${stepsSum - stepsGoal} steps over the goal!`); // и изчислявам колко повече съм изминал от целта тоест от общата сума вадя сумата на целта
            break; // и брейквам за да изляза нацяло.
        }

        stepsWalked = input[index]; // тук след провеката на предния вход взимам другия на който вече съм с точен индекс
        index++; // и веднага инкрементирам за да мога после да взема пак директно.

    }

    if (stepsWalked === "Going home") { // извън while ако стъпките който съм изминал са равни на стринга 
        let stepsToHome = Number(input[index]); // тук преобръщам в номер защото вече stepsWalked ми е било стринга и съм си взел он индекса
        stepsSum += stepsToHome; // добавям ги към общата стойност

        if (stepsSum >= stepsGoal) { // ако общата стойност е по голяма и = на целта стъпки
            console.log("Goal reached! Good job!"); // логвам
            console.log(`${stepsSum - stepsGoal} steps over the goal!`); // изчислявам от общата сума изваждам = целта и остатъка са ми стъпките който съм дори направил в повече.
        } else {
            console.log(`${stepsGoal - stepsSum} more steps to reach goal.`);
        }

    }



}

walking(["1500",
"3000",
"250",
"1548",
"2000",
"Going home",
"2000"]);